In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
df = DataFrame({'key1': list('aabba'),
                'key2': ['one', 'two', 'one', 'two', 'one'],
                'data1': np.random.random(5), 
                'data2': np.random.random(5)})

In [3]:
df

  key1 key2     data1     data2
0    a  one  0.728879  0.724052
1    a  two  0.197248  0.633546
2    b  one  0.851011  0.281978
3    b  two  0.646297  0.129958
4    a  one  0.165265  0.461074

In [4]:
grouped = df['data1'].groupby(df['key1'])

In [5]:
grouped

In [6]:
grouped.mean()

key1
a    0.363797
b    0.748654
Name: data1, dtype: float64

In [7]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [8]:
means

key1  key2
a     one     0.447072
      two     0.197248
b     one     0.851011
      two     0.646297
Name: data1, dtype: float64

In [9]:
means.unstack() # 行→列，默认内层

key2       one       two
key1
a     0.447072  0.197248
b     0.851011  0.646297

In [10]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [11]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [12]:
df['data1'].groupby([states, years]).mean()

California  2005    0.197248
            2006    0.851011
Ohio        2005    0.687588
            2006    0.165265
Name: data1, dtype: float64

In [13]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.363797  0.606224
b     0.748654  0.205968

In [14]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   0.447072  0.592563
     two   0.197248  0.633546
b    one   0.851011  0.281978
     two   0.646297  0.129958

In [15]:
# size() 返回一个包含组大小信息的Series
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

## 遍历各分组

In [16]:
for name, group in df.groupby('key1'):
    print(name)
    print('-' * 10)
    print(group)
    print('-' * 20)

a
----------
  key1 key2     data1     data2
0    a  one  0.728879  0.724052
1    a  two  0.197248  0.633546
4    a  one  0.165265  0.461074
--------------------
b
----------
  key1 key2     data1     data2
2    b  one  0.851011  0.281978
3    b  two  0.646297  0.129958
--------------------

In [17]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print('-' * 10)
    print(group)
    print('-' * 20)

('a', 'one')
----------
  key1 key2     data1     data2
0    a  one  0.728879  0.724052
4    a  one  0.165265  0.461074
--------------------
('a', 'two')
----------
  key1 key2     data1     data2
1    a  two  0.197248  0.633546
--------------------
('b', 'one')
----------
  key1 key2     data1     data2
2    b  one  0.851011  0.281978
--------------------
('b', 'two')
----------
  key1 key2     data1     data2
3    b  two  0.646297  0.129958
--------------------

In [18]:
list(df.groupby('key1'))

[('a',   key1 key2     data1     data2
  0    a  one  0.728879  0.724052
  1    a  two  0.197248  0.633546
  4    a  one  0.165265  0.461074), ('b',   key1 key2     data1     data2
  2    b  one  0.851011  0.281978
  3    b  two  0.646297  0.129958)]

In [19]:
pieces = dict(list(df.groupby('key1')))

In [20]:
pieces

{'a':   key1 key2     data1     data2
 0    a  one  0.728879  0.724052
 1    a  two  0.197248  0.633546
 4    a  one  0.165265  0.461074, 'b':   key1 key2     data1     data2
 2    b  one  0.851011  0.281978
 3    b  two  0.646297  0.129958}

In [21]:
pieces['b']

  key1 key2     data1     data2
2    b  one  0.851011  0.281978
3    b  two  0.646297  0.129958

In [22]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [23]:
grouped = df.groupby(df.dtypes, axis=1)

In [24]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0  0.728879  0.724052
1  0.197248  0.633546
2  0.851011  0.281978
3  0.646297  0.129958
4  0.165265  0.461074
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

## 选择一列或所有列的子集

In [25]:
df.groupby(['key1', 'key2'])[['data2']].mean() # 返回的是DataFrame

              data2
key1 key2
a    one   0.592563
     two   0.633546
b    one   0.281978
     two   0.129958

In [26]:
s_grouped = df.groupby(['key1', 'key2'])['data2'] # Series

In [27]:
s_grouped

In [28]:
s_grouped.mean()

key1  key2
a     one     0.592563
      two     0.633546
b     one     0.281978
      two     0.129958
Name: data2, dtype: float64

## 使用字典和Series分组

In [29]:
people = DataFrame(np.random.randn(5, 5),
                   index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'],
                   columns=list('abcde'))

In [30]:
people

               a         b         c         d         e
Joe    -0.922246  0.885368 -0.562344  0.303562  2.355511
Steve  -2.418943  0.041131  3.986815 -0.033894  0.628093
Wes     0.045051 -0.134401 -0.791947  0.631852 -1.664594
Jim     0.359933 -2.198010  2.097765  1.268576  1.303992
Travis -0.793130 -2.522770 -1.241859 -0.145493  1.074630

In [31]:
people.iloc[2:3, [1, 2]] = np.nan # Add a few NA values

In [32]:
people

               a         b         c         d         e
Joe    -0.922246  0.885368 -0.562344  0.303562  2.355511
Steve  -2.418943  0.041131  3.986815 -0.033894  0.628093
Wes     0.045051       NaN       NaN  0.631852 -1.664594
Jim     0.359933 -2.198010  2.097765  1.268576  1.303992
Travis -0.793130 -2.522770 -1.241859 -0.145493  1.074630

In [33]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 
           'd': 'blue', 'e': 'red', 'f': 'orange'}

In [34]:
by_column = people.groupby(mapping, axis=1) # 列

In [35]:
by_column.sum()

            blue       red
Joe    -0.258781  2.318633
Steve   3.952920 -1.749719
Wes     0.631852 -1.619543
Jim     3.366340 -0.534085
Travis -1.387352 -2.241271

In [36]:
map_series = Series(mapping)

In [37]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [38]:
people.groupby(map_series, axis=1).count() # 对列计数

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

## 使用函数分组

In [39]:
people.groupby(len).sum() # 根据名字的长度来分组

          a         b         c         d         e
3 -0.517262 -1.312642  1.535421  2.203990  1.994909
5 -2.418943  0.041131  3.986815 -0.033894  0.628093
6 -0.793130 -2.522770 -1.241859 -0.145493  1.074630

In [40]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [41]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.922246  0.885368 -0.562344  0.303562 -1.664594
  two  0.359933 -2.198010  2.097765  1.268576  1.303992
5 one -2.418943  0.041131  3.986815 -0.033894  0.628093
6 two -0.793130 -2.522770 -1.241859 -0.145493  1.074630

## 根据索引层级分组

In [42]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                     [1, 3, 5, 1, 3]],
                                    names=['cty', 'tenor'])

In [43]:
columns

MultiIndex(levels=[['JP', 'US'], [1, 3, 5]],
           labels=[[1, 1, 1, 0, 0], [0, 1, 2, 0, 1]],
           names=['cty', 'tenor'])

In [44]:
hier_df = DataFrame(np.random.randn(4, 5), 
                    columns=columns)

In [45]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -1.333856  0.244358 -2.367865 -0.928489  1.264879
1     -2.149753 -0.261714 -1.139223 -1.296418 -0.781453
2     -0.709356 -0.235578  0.552926 -0.138510 -0.283962
3      1.311481  0.240465 -0.346319 -0.081818 -0.887405

In [46]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3